//package com.votafore.warlords.game;
//
///**
// * @author Votafore
// * Created on 17.09.2016.
// */
//public abstract class Player {
//
//    /**
//     * Переменная, хранящая количество денег
//     */
//    public int mMoney = 0;
//
//
//    /**
//     * метод запускает процесс игры для игрока(ов)
//     * выполняет инициализации, проверки, загрузки etc.
//     */
//    public void startGame(){
//
//        // в самом начале игры у игрока есть только командный центр
//        // в нем доступны какие то начальные средства для строительства (на выбор)
//        // и, возможно, несколько технологий доступных для изучения (что бы как-то определится с направлением развития)
//
//        // уведомление системы (или других игроков) о готовности игрока
//    }
//}